import {Meta, moduleMetadata, Story} from '@storybook/angular';
import {ChartComponent} from './chart.component';
import {HighchartsChartModule} from 'highcharts-angular';
import {CommonModule} from '@angular/common';
import {StorybookConst} from '../../../shared/storybook.const';

export default {
	component: ChartComponent,
	title:  StorybookConst.charts + 'Chart',
	decorators: [
		moduleMetadata({
			imports: [HighchartsChartModule, CommonModule]
		})
	]
} as Meta;

const template: Story = (args: ChartComponent) => ({
	props: {
		...args
	}
});

export const lineChart = template.bind({});
lineChart.args = {
	data: {
		categories: [
			'янв',
			'фев',
			'мар',
			'апр',
			'май',
			'июн',
			'июл',
			'авг',
			'сен',
			'окт',
			'ноя',
			'дек'
		],
		series: [
			{
				name: 'Факт 2022',
				data: [
					45391,
					48036,
					27382,
					20367,
					20222,
					17155,
					17752,
					15072,
					null,
					null,
					null,
					null
				],
				formattedData: [
					'45 391 ',
					'48 036 ',
					'27 382 ',
					'20 367 ',
					'20 222 ',
					'17 155 ',
					'17 752 ',
					'15 072 ',
					'0 ',
					'0 ',
					'0 ',
					'0 '
				],
				labels: [
					'Факт янв 2022<br><b>45 391 </b>шт.',
					'Факт фев 2022<br><b>48 036 </b>шт.',
					'Факт мар 2022<br><b>27 382 </b>шт.',
					'Факт апр 2022<br><b>20 367 </b>шт.',
					'Факт май 2022<br><b>20 222 </b>шт.',
					'Факт июн 2022<br><b>17 155 </b>шт.',
					'Факт июл 2022<br><b>17 752 </b>шт.',
					'Факт авг 2022<br><b>15 072 </b>шт.',
					'Факт сен 2022<br><b>0 </b>шт.',
					'Факт окт 2022<br><b>0 </b>шт.',
					'Факт ноя 2022<br><b>0 </b>шт.',
					'Факт дек 2022<br><b>0 </b>шт.'
				]
			},
			{
				name: 'План 2022',
				data: [
					34321,
					41627,
					29657,
					26509,
					21463,
					23188,
					17130,
					18923,
					0,
					0,
					0,
					0
				],
				formattedData: [
					'34 321 ',
					'41 627 ',
					'29 657 ',
					'26 509 ',
					'21 463 ',
					'23 188 ',
					'17 130 ',
					'18 923 ',
					'0 ',
					'0 ',
					'0 ',
					'0 '
				],
				labels: [
					'План янв 2022<br><b>34 321 </b>шт.',
					'План фев 2022<br><b>41 627 </b>шт.',
					'План мар 2022<br><b>29 657 </b>шт.',
					'План апр 2022<br><b>26 509 </b>шт.',
					'План май 2022<br><b>21 463 </b>шт.',
					'План июн 2022<br><b>23 188 </b>шт.',
					'План июл 2022<br><b>17 130 </b>шт.',
					'План авг 2022<br><b>18 923 </b>шт.',
					'План сен 2022<br><b>0 </b>шт.',
					'План окт 2022<br><b>0 </b>шт.',
					'План ноя 2022<br><b>0 </b>шт.',
					'План дек 2022<br><b>0 </b>шт.'
				]
			},
			{
				name: 'Факт 2021',
				data: [
					35064,
					34565,
					39639,
					40279,
					38077,
					37849,
					47743,
					53170,
					58313,
					54774,
					49179,
					49633
				],
				formattedData: [
					'35 064 ',
					'34 565 ',
					'39 639 ',
					'40 279 ',
					'38 077 ',
					'37 849 ',
					'47 743 ',
					'53 170 ',
					'58 313 ',
					'54 774 ',
					'49 179 ',
					'49 633 '
				],
				labels: [
					'Факт янв 2021<br><b>35 064 </b>шт.',
					'Факт фев 2021<br><b>34 565 </b>шт.',
					'Факт мар 2021<br><b>39 639 </b>шт.',
					'Факт апр 2021<br><b>40 279 </b>шт.',
					'Факт май 2021<br><b>38 077 </b>шт.',
					'Факт июн 2021<br><b>37 849 </b>шт.',
					'Факт июл 2021<br><b>47 743 </b>шт.',
					'Факт авг 2021<br><b>53 170 </b>шт.',
					'Факт сен 2021<br><b>58 313 </b>шт.',
					'Факт окт 2021<br><b>54 774 </b>шт.',
					'Факт ноя 2021<br><b>49 179 </b>шт.',
					'Факт дек 2021<br><b>49 633 </b>шт.'
				]
			},
			{
				name: 'Факт 2020',
				data: [
					22366,
					27192,
					33419,
					13334,
					19926,
					29202,
					37514,
					44824,
					46376,
					47209,
					42929,
					38261
				],
				formattedData: [
					'22 366 ',
					'27 192 ',
					'33 419 ',
					'13 334 ',
					'19 926 ',
					'29 202 ',
					'37 514 ',
					'44 824 ',
					'46 376 ',
					'47 209 ',
					'42 929 ',
					'38 261 '
				],
				labels: [
					'Факт янв 2020<br><b>22 366 </b>шт.',
					'Факт фев 2020<br><b>27 192 </b>шт.',
					'Факт мар 2020<br><b>33 419 </b>шт.',
					'Факт апр 2020<br><b>13 334 </b>шт.',
					'Факт май 2020<br><b>19 926 </b>шт.',
					'Факт июн 2020<br><b>29 202 </b>шт.',
					'Факт июл 2020<br><b>37 514 </b>шт.',
					'Факт авг 2020<br><b>44 824 </b>шт.',
					'Факт сен 2020<br><b>46 376 </b>шт.',
					'Факт окт 2020<br><b>47 209 </b>шт.',
					'Факт ноя 2020<br><b>42 929 </b>шт.',
					'Факт дек 2020<br><b>38 261 </b>шт.'
				]
			}
		]
	}
};

